БИТУправление_медицинским_центром_демо/src/Documents/РаспределениеПрочихЗатрат/РаспределениеПрочихЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеПрочихЗатрат</name>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура затраты (т.е. не получатель затраты, а, например, полученная услуга от поставщика)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПолучатель</name>
    <comment>Номенклатура-получатель затраты</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/РаспределениеПрочихЗатрат/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет нераспределенные затраты за период
Процедура ЗаполнитьНераспределенныеЗатратыЗаПериод() Экспорт
	
	Затраты.Загрузить(ПолучитьТаблицуНераспределенныхЗатратДляРегистраторв());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуНераспределенныхЗатратДляРегистраторв() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗатратыОбороты.СтатьяЗатрат,
	|	СУММА(ЗатратыОбороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Затраты.Обороты(&ДатаНач, &ДатаКон, Регистратор, КатегорияВыработки = ЗНАЧЕНИЕ(Справочник.КатегорииВыработки.ПустаяСсылка)) КАК ЗатратыОбороты
	|ГДЕ
	|	ЗатратыОбороты.Регистратор <> &Ссылка
	|	И ЗатратыОбороты.Филиал = &Филиал
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыОбороты.СтатьяЗатрат
	|ИМЕЮЩИЕ СУММА(ЗатратыОбороты.СуммаОборот) <> 0 
	|"
	;
	Запрос.УстановитьПараметр("ДатаНач", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", Новый Граница(КонецДня(КонецПериода),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка" , Ссылка);
	Запрос.УстановитьПараметр("Филиал"  , Филиал);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПроверитьПревышениеНераспределенныхЗатрат()
	
	НераспределенныеЗатраты = ПолучитьТаблицуНераспределенныхЗатратДляРегистраторв();
	
	НераспределенныеЗатраты.Свернуть("СтатьяЗатрат","Сумма");
	
	РаспределяемыеЗатраты = Затраты.Выгрузить();
	РаспределяемыеЗатраты.Свернуть("СтатьяЗатрат","Сумма");
	Для Каждого СтрокаЗатрат Из РаспределяемыеЗатраты Цикл
		
		СтрокаНераспрЗатрат = НераспределенныеЗатраты.Найти(СтрокаЗатрат.СтатьяЗатрат,"СтатьяЗатрат");
		СуммаНераспрЗатрат = ?(СтрокаНераспрЗатрат = Неопределено,0,СтрокаНераспрЗатрат.Сумма);
		Если СуммаНераспрЗатрат < СтрокаЗатрат.Сумма Тогда
			ТекстСообщения = НСтр("ru=	'Для статьи затрат ""%1"" распределяемая документом сумма: %2
										|превышает сумму непрапределенных затрат по данной статье за период документа %3'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(СтрокаЗатрат.СтатьяЗатрат), ОбщегоНазначенияКлиентСервер.ФорматСумм(СтрокаЗатрат.Сумма), ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаНераспрЗатрат));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуДвиженияЗатраты(ФилиалЗатрат,СтатьяЗатрат,КатегорияВыработки,Сумма)
	
	Движение = Движения.Затраты.Добавить();
	Движение.Регистратор  = Ссылка;
	Движение.Период		  = Дата;
	Движение.Сумма		  = Сумма;
	Движение.СтатьяЗатрат = СтатьяЗатрат;
	Движение.КатегорияВыработки = КатегорияВыработки;
	Движение.Филиал		  = ФилиалЗатрат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеДокументов.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = НСтр("ru='Проведение документа'") + " """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("СтатьяЗатрат");
	СтруктураОбязательныхПолей.Вставить("Сумма");
	ПроведениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Затраты", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		
		ПроверитьПревышениеНераспределенныхЗатрат() ;
		
		// Движения по регистру затрат
		Для Каждого СтрокаТЧ Из Затраты Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.КатегорияВыработки) Тогда
				ДобавитьСтрокуДвиженияЗатраты(Филиал, СтрокаТЧ.СтатьяЗатрат, СтрокаТЧ.КатегорияВыработки, СтрокаТЧ.Сумма);
				ДобавитьСтрокуДвиженияЗатраты(Филиал, СтрокаТЧ.СтатьяЗатрат, Справочники.КатегорииВыработки.ПустаяСсылка(), -СтрокаТЧ.Сумма);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти
